In [19]:
from sqlalchemy import create_engine
import pandas as pd
from faker import Faker
import random
from datetime import datetime, timedelta

engine = create_engine("postgresql://postgres:789456femi@localhost:5432/postgres")

In [20]:
fake = Faker()
customers_data = []

for _ in range(100):  
    customers_data.append({
        "names": fake.name(),
        "documents": str(fake.random_number(9)),
        "phone": fake.random_number(10),
        "email": fake.email(),
        "monthly_income": str(random.randint(1000000, 6000000)),
        "risk_score": random.randint(100, 800),
        "registration_date": fake.date_between(start_date='-3y', end_date='today')
    })

df_customers = pd.DataFrame(customers_data)
df_customers.to_sql("customers", engine, schema="analisis", if_exists="append", index=False)

df_customers.head()

,names,documents,phone,email,monthly_income,risk_score,registration_date
0,Steve Parrish,822287160,5767224857,amanda75@example.org,3305629,517,2023-04-28
1,Patrick Bauer MD,486985459,5793393485,mercadosarah@example.net,2493745,419,2025-08-21
2,David Johnson,567671892,9532225935,wfreeman@example.com,5283919,355,2023-08-21
3,Stephanie Mullen,994764294,3888434753,alvaradojacob@example.com,4425683,396,2025-03-09
4,Michael Rojas,955680033,6364038705,ericmiddleton@example.org,1646561,341,2024-01-01

In [21]:
loans_data = []

customer_ids = pd.read_sql("SELECT id_customer FROM analisis.customers", engine)["id_customer"]

for customer_id in customer_ids:
    for _ in range(random.randint(1, 3)):  
        start = fake.date_between(start_date='-2y', end_date='today')
        term = random.choice([6, 12, 24, 36])
        end = start + timedelta(days=term*30)

        loans_data.append({
            "capital": round(random.uniform(500000, 10000000), 2),
            "interest_rate": round(random.uniform(1.0, 5.0), 2),
            "term_months": term,
            "start_date": start,
            "end_date": end,
            "state": random.choice(["Asset", "Paid", "In arrears"]),
            "calculated_risk": round(random.uniform(0.1, 0.9), 2),
            "id_customer": customer_id
        })

df_loans = pd.DataFrame(loans_data)
df_loans.to_sql("loans", engine, schema="analisis", if_exists="append", index=False)

df_loans.head()

,capital,interest_rate,term_months,start_date,end_date,state,calculated_risk,id_customer
0,5917657.85,3.92,12,2023-12-18,2024-12-12,In arrears,0.56,1
1,9249348.19,3.99,36,2023-12-30,2026-12-14,Asset,0.80,2
2,1971436.51,4.31,24,2025-10-29,2027-10-19,In arrears,0.21,2
3,6952471.97,3.05,24,2024-05-12,2026-05-02,In arrears,0.69,2
4,1363978.64,3.97,6,2025-12-10,2026-06-08,In arrears,0.26,3

In [22]:
payments_data = []

loan_ids = pd.read_sql("SELECT id_loan FROM analisis.loans", engine)["id_loan"]

for loan_id in loan_ids:
    num_payments = random.randint(3, 15)

    for _ in range(num_payments):
        payment_date = fake.date_between(start_date='-2y', end_date='today')
        amount = round(random.uniform(50000, 500000), 2)

        payments_data.append({
            "payment_date": payment_date,
            "paid_amount": amount,
            "interest_paid": round(amount * random.uniform(0.1, 0.4), 2),
            "main_paid": round(amount * random.uniform(0.6, 0.9), 2),
            "days_late": random.randint(0, 60),
            "id_loan": loan_id
        })

df_payments = pd.DataFrame(payments_data)
df_payments.to_sql("payments", engine, schema="analisis", if_exists="append", index=False)

df_payments.head()

  payment_date  paid_amount  interest_paid  main_paid  days_late  id_loan
0   2024-12-07    368000.44       57972.95  262571.79         37        1
1   2025-07-15    278736.73       45558.74  173512.65         49        1
2   2025-05-21    150698.33       56753.24  105856.24         51        1
3   2024-04-09    160210.82       62058.36  112306.59         40        1
4   2025-07-09    288855.89       77050.43  209728.70         54        1

In [23]:
payments_data = []

loan_ids = pd.read_sql("SELECT id_loan FROM analisis.loans", engine)["id_loan"]

for loan_id in loan_ids:
    num_payments = random.randint(3, 15)

    for _ in range(num_payments):
        payment_date = fake.date_between(start_date='-2y', end_date='today')
        amount = round(random.uniform(50000, 500000), 2)

        payments_data.append({
            "payment_date": payment_date,
            "paid_amount": amount,
            "interest_paid": round(amount * random.uniform(0.1, 0.4), 2),
            "main_paid": round(amount * random.uniform(0.6, 0.9), 2),
            "days_late": random.randint(0, 60),
            "id_loan": loan_id
        })

df_payments = pd.DataFrame(payments_data)
df_payments.to_sql("payments", engine, schema="analisis", if_exists="append", index=False)

df_payments.head()

  payment_date  paid_amount  interest_paid  main_paid  days_late  id_loan
0   2025-02-15    460775.55      111256.91  396936.88         11        1
1   2025-04-17    119896.89       15834.10   98418.07         46        1
2   2024-04-26    455969.26      128979.66  283276.98         47        1
3   2025-06-14    274930.97       96800.17  208862.85          5        1
4   2024-03-13    142940.23       42411.50  127900.50         30        1

In [24]:
rates_data = []

for _ in range(100):
    date = fake.date_between(start_date='-1y', end_date='today')
    min_rate = round(random.uniform(0.5, 2.0), 2)
    max_rate = round(random.uniform(2.0, 5.0), 2)

    rates_data.append({
        "dates": date,
        "minimum_rate": min_rate,
        "maximum_rate": max_rate,
        "observations": fake.sentence(nb_words=5)
    })

df_rates = pd.DataFrame(rates_data)
df_rates.to_sql("interest_rates", engine, schema="analisis", if_exists="append", index=False)

df_rates.head()

,dates,minimum_rate,maximum_rate,observations
0,2025-06-21,1.80,3.66,Its course analysis actually tax finish.
1,2025-09-21,0.98,3.46,Water entire believe civil moment.
2,2025-04-09,1.55,4.70,Dog sing policy turn.
3,2025-12-02,0.98,3.14,College think matter close room PM.
4,2025-05-18,0.93,4.63,Like piece cup interview.

In [25]:
assessments_data = []

for _ in range(100):
    assessments_data.append({
        "score": random.randint(100, 800),
        "levels": random.choice(["Low", "Half", "High"]),
        "justification": fake.sentence(nb_words=8),
        "id_customer": random.choice(customer_ids),
        "id_loan": random.choice(loan_ids)
    })

df_assessments = pd.DataFrame(assessments_data)
df_assessments.to_sql("risk_assessment", engine, schema="analisis", if_exists="append", index=False)

df_assessments.head()

,score,levels,justification,id_customer,id_loan
0,133,High,According task choice stay.,7,159
1,257,Low,Finally consumer body walk mind.,95,28
2,648,High,Interest debate or job memory some.,33,117
3,633,Low,Several other technology example address.,10,192
4,569,Low,Tell owner station yet meet water accept devel...,86,108